tap "cockroachdb/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "pulumi/tap"
tap "rcmdnk/file"
brew "glib"
brew "harfbuzz"
brew "zstd"
brew "little-cms2"
brew "openjdk@11"
brew "apache-flink"
brew "apache-spark"
brew "bat"
brew "cassandra"
brew "deno", link: false
brew "fd"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "helix"
brew "openjdk"
brew "zookeeper"
brew "kafka"
brew "krb5"
brew "python@3.11"
brew "llvm"
brew "lua"
brew "minikube"
brew "pinentry-mac"
brew "pipx"
brew "podman"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "cockroachdb/tap/cockroach"
brew "pulumi/tap/pulumi"
brew "rcmdnk/file/brew-file"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "podman-desktop"
cask "wezterm"
vscode "aldijav.golangwithdidi"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "joshmu.periscope"
vscode "maattdd.gitless"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "nhoizey.gremlins"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "snowflake.snowflake-vsc"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "zxh404.vscode-proto3"
