tap "cockroachdb/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "pulumi/tap"
tap "rcmdnk/file"
brew "glib"
brew "harfbuzz"
brew "zstd"
brew "little-cms2"
brew "openjdk@11"
brew "apache-flink"
brew "apache-spark"
brew "bat"
brew "cassandra"
brew "deno", link: false
brew "fd"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "helix"
brew "openjdk"
brew "zookeeper"
brew "kafka"
brew "krb5"
brew "python@3.11"
brew "llvm"
brew "lua"
brew "minikube"
brew "pinentry-mac"
brew "pipx"
brew "podman"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "cockroachdb/tap/cockroach"
brew "lazygit"
brew "pulumi/tap/pulumi"
brew "rcmdnk/file/brew-file"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "podman-desktop"
cask "wezterm"
brew "tmuxinator"
brew "delve"
